using HuangD.Sessions.Maps;
using HuangD.Sessions.Utilties;
using System;
using System.Collections.Generic;
using System.Linq;
using static HuangD.Sessions.Maps.Builders.MapBuilder;

namespace HuangD.Sessions;

public partial class Province
{
    public static class Builder
    {
        public static Dictionary<Block, Province> Build(Dictionary<Block, TerrainType> block2Terrain, string seed)
        {
            var pops = PopCountBuilder.Build(block2Terrain, seed);

            var result = new Dictionary<Block, Province>();
            foreach (var pair in block2Terrain.Where(pair => pair.Value != TerrainType.Water))
            {
                var province = new Province(UUID.Generate("PROV"), GenerateProvinceName(result.Values.Select(x => x.Name)))
                {
                    BlockId = pair.Key.Id,
                    PopCount = pops[pair.Key]
                };

                result.Add(pair.Key, province);
            }

            return result;
        }

        private static string[] Names = {"华州","同州","坊州","丹州", "榆州", "泾州","陇州","宁州","庆州","洹州","定州","绥州","银州","夏州","灵州","盐州","丰州","会州","宥州","胜州","麟州","汴州","孟州","陕州","虢州","汝州","许州","蔡州","陈州","亳州","宋州","濮州","郓州","泗州","海州","兖州","徐州","宿州","沂州","密州","齐州","青州","棣州","莱州","登州","绛州","晋州","隰州","汾州","慈州","潞州","泽州","沁州","辽州","蔚州","忻州","岚州","石州","朔州","云州","魏州","怀州","卫州","相州","澶州","博州","贝州","洛州","磁州","邢州","赵州","冀州","深州","沧州","景州","德州","祁州","易州","瀛州","莫州","幽州","涿州","檀州","妫州","平州","顺州","归州","营州","燕州","威州","慎州","玄州","崇州","桑州","师州","鲜州","带州","黎州","沃州","昌州","义州","瑞州","信州","汕州","凛州","襄州","兴州","凤州","利州","通州","洋州","合州","集州","巴州","蓬州","壁州","商州","金州","开州","渠州","渝州","邓州","唐州","均州","房州","隋州","郢州","复州","陵州","硖州","夔州","万州","忠州","扬州","楚州","和州","濠州","寿州","光州","蕲州","申州","黄州","安州","舒州","润州","常州","苏州","湖州","杭州","越州","明州","台州","婺州","衢州","睦州","歙州","处州","温州","福州","泉州","建州","汀州","漳州","宣州","池州","洪州","虔州","抚州","吉州","江州","袁州","鄂州","岳州","潭州","衡州","澧州","朗州","永州","道州","郴州","邵州","连州","黔州","辰州","锦州","施州","巫州","夷州","播州","思州","费州","南州","溪州","溱州","珍州","珜州","鄯州","秦州","成州","渭州","兰州","临州","河州","武州","洮州","廓州","叠州","宕州","凉州","甘州","瓜州","伊州","沙州","西州","汉州","彭州","蜀州","眉州","剑州","梓州","阆州","果州","遂州","普州","资州","荣州","简州","嘉州","邛州","雅州","泸州","茂州","翼州","涂州","炎州","彻州","向州","冉州","穹州","笮州","戎州","嵩州","松州","文州","扶州","龙州","当州","悉州","恭州","保州","真州","霸州","柘州","广州","韶州","循州","贺州","端州","新州","康州","封州","泷州","恩州","春州","高州","藤州","窦州","勤州","桂州","昭州","富州","梧州","蒙州","龚州","浔州","郁州","琴州","宾州","澄州","绣州","象州","柳州","融州","邕州","贵州","党州","田州","严州","山州","峦州","罗州","潘州","容州", "涑州", "白州", "淯州", "钦州","禺州", "淮州", "汤州","岩州", "鸿州", "峨州","锡州","芝州", "潍州", "禄州","长州","灌州","林州","峰州","陆州","廉州","雷州","笼州","环州","化州","芒州","崖州","儋州","琼州","振州","充州","耀州","肃州","葛州","盖州","柏州","樊州","昆州","辉州","英州","应州","岐州","恒州","宛州","尧州","舜州","禹州","雁州","延州","苍州","原州","运州","瀚州","淄州","铜州","梁州","吴州","韩州","晏州","津州","蓟州","珠州","梅州","株州","饶州","济州","横州","竺州" };

        private static string GenerateProvinceName(IEnumerable<string> usedNames)
        {
            return Names.Except(usedNames).First();
        }
    }
}
